In [1]:
import sqlite3

In [3]:
conn = sqlite3.connect("/Users/gimdong-wan/Desktop/김동완 수업자료/통계 데이터베이스/PythonSQL/Customer.db", isolation_level=None)

※ commit & rollback
sqlite3.connect() 괄호 안에 isolation_level=None이라고 명시했는데 이는 (실습을 위해) 쿼리문을 실행하여 DB에 즉시 반영, 즉시 자동 커밋을 하기 위함이다. commit(커밋)은 “변경사항을 DB에 반 영한다”는 뜻이며 commit을 하지 않으면 수정(추가/갱신/삭제 등) 작업에 대한 기록을 컴퓨터 메모 리 같은 데 임시로 가지고 있을 뿐 실제로 DB에는 반영하지 않는다. 최종적으로 DB를 수정을 하려 면 마지막에 반드시 conn.commit()이라는 명령을 실행해주어야 한다.
참고로 commit과 반대되는 개념으로 rollback(롤백)이 있다. 이전 이력으로 되돌린다는 뜻으로 conn.rollback() 으로 실행한다.

In [4]:
conn.close()

In [6]:
# Customer 데이터베이스 연결
conn = sqlite3.connect("/Users/gimdong-wan/Desktop/김동완 수업자료/통계 데이터베이스/PythonSQL/Customer.db", isolation_level=None)

In [7]:
# 커서 생성
c = conn.cursor()

※ cursor
파이썬에서 파일을 읽고 쓰려면 커서를 가져와야 한다. 그래서 conn.cursor()로 일단 커서를 생성 한다.

In [8]:
# Customer_Info 테이블 생성하기
sql = """CREATE TABLE IF NOT EXISTS Customer_Info
( CID TEXT PRIMARY KEY, 
Name TEXT,
Address TEXT, Tel TEXT, BDay TEXT, SID TEXT,
Job TEXT,
Sex TEXT,
Married TEXT )"""

※ """...""" 또는'''...''' multiline 문자열을 변수에 저장하는 방법

In [9]:
c.execute(sql)

In [11]:
# 테이블이 생성되었는지(존재하는지) 확인
check="SELECT count(*) FROM sqlite_master WHERE name='Customer_Info'" 
c.execute(check)
c.fetchone()

(1,)

※ fetchone(), fetchall()
c.fetchone()을 사용하면 한 줄씩 출력하는 걸 알 수 있다. 커서가 이동하기 때문이다. 그리고 이후 에 c.fetchall()이라는 걸 사용해서 전체를 가져와서 출력하더라도 이미 읽은 지점 이후에 있는 것 들만 출력된다. (참고로 fetch는 “가져오다”라는 뜻)

In [21]:
#[예제 4-4] 코드 : Customer 데이터베이스에 Customer_Score 테이블을 생성하는 다음과 같다.
# Customer_Score 테이블 생성하기
sql = """CREATE TABLE IF NOT EXISTS Customer_Score
( CID TEXT,
Year TEXT not null,
On_Score INTEGER default 0,
Off_Score INTEGER default 0,
PRIMARY KEY (CID, Year),
FOREIGN KEY(CID) REFERENCES Customer_Info(CID) )"""
c.execute(sql)

In [22]:
# 테이블이 생성되었는지(존재하는지) 확인
check="SELECT count(*) FROM sqlite_master WHERE name='Customer_Score'" 
c.execute(check)
c.fetchone()

(1,)

In [20]:
'''
# Customer_Score 테이블 삭제하기
sql = "DROP TABLE Customer_Score" 
c.execute(sql)
# 테이블이 삭제되었는지 확인
check="SELECT count(*) FROM sqlite_master WHERE name='Customer_Score'" 
c.execute(check)
c.fetchone()
'''

'\n# Customer_Score 테이블 삭제하기\nsql = "DROP TABLE Customer_Score" \nc.execute(sql)\n# 테이블이 삭제되었는지 확인\ncheck="SELECT count(*) FROM sqlite_master WHERE name=\'Customer_Score\'" \nc.execute(check)\nc.fetchone()\n'

In [17]:
# Customer_Info 테이블에 데이터 insert 
sql = """ INSERT INTO Customer_Info
VALUES ('100001', '김민지', '서울시 광진구', '423-8627', '1975-07-01', '750701-2534218', '공무원', '1', '0') """
c.execute(sql)

In [18]:
# Customer_Info 테이블에 데이터 삽입 결과 확인 
check="SELECT * FROM Customer_Info" 
c.execute(check)
c.fetchone()

('100001',
 '김민지',
 '서울시 광진구',
 '423-8627',
 '1975-07-01',
 '750701-2534218',
 '공무원',
 '1',
 '0')

In [24]:
# Customer_Score 테이블에 데이터 insert 
sql = """ INSERT INTO Customer_Score
VALUES ('100001', '2012', 42, 111) """ 
c.execute(sql)

In [25]:
sql = """ INSERT INTO Customer_Score VALUES ('100001', '2013', 58, 89) """
c.execute(sql)

In [27]:
# Customer_Score 테이블에 데이터 삽입 결과 확인 
check="SELECT * FROM Customer_Score" 
c.execute(check)
c.fetchall()

[('100001', '2012', 42, 111), ('100001', '2013', 58, 89)]

In [31]:
#[예제 4-7] Customer_Info 테이블과 Customer_Score 테이블에 있는 특정 데이터를 갱신하는 코드는 다음과 같다.
# Customer_Info 테이블에 있는 데이터 update
sql = "UPDATE Customer_Info SET Address = '서울시 영등포구' WHERE CID = '100001' "
c.execute(sql)

In [34]:
# Customer_Score 테이블에 있는 데이터 update
sql = "UPDATE Customer_Score SET Off_Score = 98 WHERE CID = '100001' and Year='2013' " 
c.execute(sql)

In [35]:
# Customer_Info 테이블에 있는 데이터 갱신 결과 확인 
check="SELECT * FROM Customer_Info" 
c.execute(check)
c.fetchone()

('100001',
 '김민지',
 '서울시 영등포구',
 '423-8627',
 '1975-07-01',
 '750701-2534218',
 '공무원',
 '1',
 '0')

In [36]:
# Customer_Score 테이블에 있는 데이터 갱신 결과 확인 
check="SELECT * FROM Customer_Score" 
c.execute(check)
c.fetchall()

[('100001', '2012', 42, 111), ('100001', '2013', 58, 98)]

In [38]:
#[예제 4-8] Customer_Info 테이블과 Customer_Score 테이블에 있는 데이터를 삭제하는 코드는 다음 과 같다.
# Customer_Score 테이블에 있는 특정 데이터 delete
sql = "DELETE FROM Customer_Score WHERE CID = '100001' and Year='2013' " 
c.execute(sql)
# Customer_Score 테이블에 있는 특정 데이터 삭제 결과 확인 
check="SELECT * FROM Customer_Score"
c.execute(check)
c.fetchall()
# Customer_Score 테이블에 있는 전체 데이터 delete 
sql = "DELETE FROM Customer_Score " 
c.execute(sql)
# Customer_Score 테이블에 있는 전체 데이터 삭제 결과 확인 
check="SELECT * FROM Customer_Score"
c.execute(check)
c.fetchall()

[]

In [41]:
#[예제 4-9] customer_data.csv 화일에 있는 데이터를 Customer_Info 테이블에 삽입하는 코드는 다음 과 같다.
# Customer 데이터베이스 연결
conn = sqlite3.connect("/Users/gimdong-wan/Desktop/김동완 수업자료/통계 데이터베이스/PythonSQL/Customer.db", isolation_level=None) 
c = conn.cursor()
sql = "DELETE FROM Customer_Info " 
c.execute(sql)

In [44]:
# CSV 화일의 데이터를 Customer_Info 테이블에 삽입하기 
import pandas as pd
customer_data = pd.read_csv('/Users/gimdong-wan/Desktop/김동완 수업자료/통계 데이터베이스/PythonSQL/customer_data.csv', encoding='euc-kr')
customer_data.to_sql('Customer_Info', conn, if_exists='append', index=False)

In [47]:
# Customer_Info 테이블에 있는 데이터 확인하기 
check="SELECT * FROM Customer_Info" 
c.execute(check)
c.fetchall()

[('100001',
  '김민주',
  '서울시 광진구',
  '423-8627',
  '1975-07-01',
  '750701-2534218',
  '공무원',
  '1',
  '0'),
 ('100002',
  '정영미',
  '경기도 수원시',
  '321-4568',
  '1977-02-01',
  '770201-2834721',
  '회사원',
  '1',
  '1'),
 ('100003',
  '최소영',
  '제주도 서귀포시',
  '624-2172',
  '1980-01-25',
  '800125-2432712',
  '학생',
  '1',
  '0'),
 ('100004',
  '박진재',
  '강원도 속초시',
  '543-9467',
  '1960-05-02',
  '600502-1645394',
  '공무원',
  '0',
  '1'),
 ('100005',
  '이순석',
  '충남 보령시',
  '254-9124',
  '1982-06-01',
  '820601-1543714',
  '회사원',
  '0',
  '0'),
 ('100006',
  '박선희',
  '서울시 강남구',
  '459-2187',
  '1975-04-05',
  '801220-2487416',
  '회사원',
  '1',
  '0'),
 ('100007',
  '김화연',
  '경남 경주시',
  '284-8147',
  '1980-01-04',
  '790221-2482217',
  '학생',
  '1',
  '0'),
 ('100008',
  '박민선',
  '부산시 해운대구',
  '347-9124',
  '1985-04-04',
  '850527-2123827',
  '학생',
  '1',
  '0'),
 ('100009',
  '노상수',
  '전북 군산시',
  '547-2984',
  '1981-01-30',
  '741025-1441282',
  '공무원',
  '0',
  '1'),
 ('100010',
  '이민석',
  '경기도 수원시',
  '354-2723',
  '1972-08-02',
  '720802-1481395',
  '회사원',
  '0',
  '1'),
 ('100011',
  '정영미',
  '서울시 관악구',
  '272-6745',
  '1974-09-21',
  '740921-2782216',
  '주부',
  '1',
  '1')]

In [48]:
#[예제 4-10] customer_score.csv 화일에 있는 데이터를 Customer_Score 테이블에 삽입하는 코드는 다 음과 같다.
# CSV 화일의 데이터를 Customer_Score 테이블에 삽입하기
customer_score = pd.read_csv('/Users/gimdong-wan/Desktop/김동완 수업자료/통계 데이터베이스/PythonSQL/customer_score.csv', encoding='euc-kr') 
customer_score.to_sql('Customer_Score', conn, if_exists='append', index=False)
# Customer_Score 테이블에 있는 데이터 확인하기 
check="SELECT * FROM Customer_Score" 
c.execute(check)
c.fetchall()

[('100001', '2012', 42, 111),
 ('100002', '2012', 12, 30),
 ('100003', '2012', 86, 128),
 ('100004', '2012', 0, 87),
 ('100005', '2012', 122, 56),
 ('100006', '2012', 98, 17),
 ('100007', '2012', 0, 0),
 ('100008', '2012', 56, 172),
 ('100009', '2012', 24, 45),
 ('100010', '2012', 0, 21),
 ('100011', '2012', 0, 39),
 ('100001', '2013', 58, 89),
 ('100002', '2013', 98, 40),
 ('100003', '2013', 402, 128),
 ('100004', '2013', 0, 74),
 ('100005', '2013', 356, 132),
 ('100006', '2013', 66, 12),
 ('100007', '2013', 0, 5),
 ('100008', '2013', 44, 98),
 ('100009', '2013', 2, 6),
 ('100010', '2013', 0, 0),
 ('100011', '2013', 0, 48)]

In [49]:
#[예제 4-11] 테이블 Customer_Info에서 고객의 직업에 대해 살펴보고자 한다. 
#고객번호(CID)와 이름 (Name), 직업(Job) 필드의 데이터를 검색해 보아라(일부 필드 검색).
#테이블의 일부 또는 전체 필드 검색 
sql = """ SELECT CID, Name, Job
FROM Customer_Info""" 
c.execute(sql)
c.fetchall()

[('100001', '김민주', '공무원'),
 ('100002', '정영미', '회사원'),
 ('100003', '최소영', '학생'),
 ('100004', '박진재', '공무원'),
 ('100005', '이순석', '회사원'),
 ('100006', '박선희', '회사원'),
 ('100007', '김화연', '학생'),
 ('100008', '박민선', '학생'),
 ('100009', '노상수', '공무원'),
 ('100010', '이민석', '회사원'),
 ('100011', '정영미', '주부')]

In [50]:
#[예제 4-12] 테이블 Customer_Info에서 전체 필드의 데이터를 검색해 보아라.
sql = """SELECT * FROM Customer_Info""" 
c.execute(sql)
c.fetchall()
sql = """SELECT CID, Name, Address, Tel, Bday, SID, Job, Sex, Married FROM Customer_Info"""
c.execute(sql) 
c.fetchall()

[('100001',
  '김민주',
  '서울시 광진구',
  '423-8627',
  '1975-07-01',
  '750701-2534218',
  '공무원',
  '1',
  '0'),
 ('100002',
  '정영미',
  '경기도 수원시',
  '321-4568',
  '1977-02-01',
  '770201-2834721',
  '회사원',
  '1',
  '1'),
 ('100003',
  '최소영',
  '제주도 서귀포시',
  '624-2172',
  '1980-01-25',
  '800125-2432712',
  '학생',
  '1',
  '0'),
 ('100004',
  '박진재',
  '강원도 속초시',
  '543-9467',
  '1960-05-02',
  '600502-1645394',
  '공무원',
  '0',
  '1'),
 ('100005',
  '이순석',
  '충남 보령시',
  '254-9124',
  '1982-06-01',
  '820601-1543714',
  '회사원',
  '0',
  '0'),
 ('100006',
  '박선희',
  '서울시 강남구',
  '459-2187',
  '1975-04-05',
  '801220-2487416',
  '회사원',
  '1',
  '0'),
 ('100007',
  '김화연',
  '경남 경주시',
  '284-8147',
  '1980-01-04',
  '790221-2482217',
  '학생',
  '1',
  '0'),
 ('100008',
  '박민선',
  '부산시 해운대구',
  '347-9124',
  '1985-04-04',
  '850527-2123827',
  '학생',
  '1',
  '0'),
 ('100009',
  '노상수',
  '전북 군산시',
  '547-2984',
  '1981-01-30',
  '741025-1441282',
  '공무원',
  '0',
  '1'),
 ('100010',
  '이민석',
  '경기도 수원시',
  '354-2723',
  '1972-08-02',
  '720802-1481395',
  '회사원',
  '0',
  '1'),
 ('100011',
  '정영미',
  '서울시 관악구',
  '272-6745',
  '1974-09-21',
  '740921-2782216',
  '주부',
  '1',
  '1')]

In [51]:
#[예제 4-13] 테이블 Customer_Info에는 Job 필드가 존재하며, 고객들의 직업은 중복해서 나타난다. 중 복을 제거하고 고객들의 직업을 검색해 보아라.
sql = "SELECT DISTINCT Job FROM Customer_Info" 
c.execute(sql)
c.fetchall()

[('공무원',), ('회사원',), ('학생',), ('주부',)]

In [52]:
#[예제 4-14] 테이블 Customer_Info에는 Job, Sex 필드가 존재한다. 고객들의 직업, 성별을 중복을 제 거하고 검색해 보아라.
sql = "SELECT DISTINCT Job, Sex FROM Customer_Info" 
c.execute(sql)
c.fetchall()

[('공무원', '1'),
 ('회사원', '1'),
 ('학생', '1'),
 ('공무원', '0'),
 ('회사원', '0'),
 ('주부', '1')]

(3) 특정한 레코드의 조건 검색 : WHERE
테이블에서 원하는 조건에 맞는 특정한 레코드만 검색하기 위해서는 WHERE 절을 이용한다. WHERE 절은 테이블의 필드 값을 다양한 연산자와 함수를 이용하여 그 조건을 만족하는 레코드만 선택되도록 한다. 일반적으로 WHERE 절에 나오는 조건식에는 비교연산자, 논리연산자 등이 많이 이용되며 IN, LIKE, IS NULL 등과 같은 SQL 연산자도 이용될 수 있다.

In [54]:
#[예제 4-15] Customer_Info 테이블에서 직업이 ‘회사원’인 고객의 고객번호(CID), 이름(Name), 직업 (Job), 결혼여부(Married)를 검색해 보아라.
sql = """SELECT CID, Name, Job, Married FROM Customer_Info WHERE Job = '회사원' """ 
c.execute(sql)
c.fetchall()

[('100002', '정영미', '회사원', '1'),
 ('100005', '이순석', '회사원', '0'),
 ('100006', '박선희', '회사원', '0'),
 ('100010', '이민석', '회사원', '1')]

In [57]:
#[예제 4-16] Customer_Info 테이블에서 직업이 ‘회사원’이 아닌 고객의 고객번호(CID), 이름(Name), 직업(Job), 결혼여부(Married)를 검색해 보아라.
sql = """SELECT CID, Name, Job, Married FROM Customer_Info WHERE Job != '회사원' """ 
c.execute(sql)
c.fetchall()

[('100001', '김민주', '공무원', '0'),
 ('100003', '최소영', '학생', '0'),
 ('100004', '박진재', '공무원', '1'),
 ('100007', '김화연', '학생', '0'),
 ('100008', '박민선', '학생', '0'),
 ('100009', '노상수', '공무원', '1'),
 ('100011', '정영미', '주부', '1')]

In [58]:
#[예제 4-17] Customer_Info 테이블에서 성별(Sex)과 결혼여부(Married)가 모두 1인 고객의 고객번호 (CID), 이름(Name), 성별(Sex), 결혼여부(Married)를 검색해 보아라.
sql = """SELECT CID, Name, Sex, Married FROM Customer_Info WHERE Sex='1' and Married='1' """ 
c.execute(sql)
c.fetchall()

[('100002', '정영미', '1', '1'), ('100011', '정영미', '1', '1')]

In [61]:
#[예제 4-18] Customer_Score 테이블에서 2013년의 온라인점수(On_Score)가 50 이상이고 100이하인레코드를 검색해 보아라.
sql = """SELECT CID, Year, On_Score FROM Customer_Score WHERE Year=2013 and
On_Score>=50 and On_Score<=100 """
c.execute(sql) 
c.fetchall()

[('100001', '2013', 58), ('100002', '2013', 98), ('100006', '2013', 66)]

In [62]:
#[예제 4-19] Customer_Score 테이블에는 온라인점수(On_Score)와 오프라인점수(Off_Score)가 년도별 로 집계되어 있다. 2013년의 온라인 고객점수와 오프라인 고객점수의 합(TotalScore)을 검 색해 보아라.
sql = """SELECT CID, Year, On_Score+Off_Score TotalScore FROM Customer_Score
WHERE Year=2013 """ 
c.execute(sql)
c.fetchall()

[('100001', '2013', 147),
 ('100002', '2013', 138),
 ('100003', '2013', 530),
 ('100004', '2013', 74),
 ('100005', '2013', 488),
 ('100006', '2013', 78),
 ('100007', '2013', 5),
 ('100008', '2013', 142),
 ('100009', '2013', 8),
 ('100010', '2013', 0),
 ('100011', '2013', 48)]

In [63]:
#[예제 4-20] Customer_Score 테이블에서 2013년의 온라인 고객점수와 오프라인 고객점수의 합 (TotalScore)이 100 이상인 고객을 검색해 보아라.
sql = """SELECT CID, Year, On_Score+Off_Score TotalScore FROM Customer_Score
WHERE Year=2013 and TotalScore>100 """
c.execute(sql)
c.fetchall()

[('100001', '2013', 147),
 ('100002', '2013', 138),
 ('100003', '2013', 530),
 ('100005', '2013', 488),
 ('100008', '2013', 142)]

In [64]:
#[예제 4-21] Customer_Info 테이블에서 주소(Address)가 널 값이 아닌 레코드를 검색해 보아라.
sql = """SELECT *
FROM Customer_Info
WHERE Address IS NOT NULL """ 
c.execute(sql)
c.fetchall()

[('100001',
  '김민주',
  '서울시 광진구',
  '423-8627',
  '1975-07-01',
  '750701-2534218',
  '공무원',
  '1',
  '0'),
 ('100002',
  '정영미',
  '경기도 수원시',
  '321-4568',
  '1977-02-01',
  '770201-2834721',
  '회사원',
  '1',
  '1'),
 ('100003',
  '최소영',
  '제주도 서귀포시',
  '624-2172',
  '1980-01-25',
  '800125-2432712',
  '학생',
  '1',
  '0'),
 ('100004',
  '박진재',
  '강원도 속초시',
  '543-9467',
  '1960-05-02',
  '600502-1645394',
  '공무원',
  '0',
  '1'),
 ('100005',
  '이순석',
  '충남 보령시',
  '254-9124',
  '1982-06-01',
  '820601-1543714',
  '회사원',
  '0',
  '0'),
 ('100006',
  '박선희',
  '서울시 강남구',
  '459-2187',
  '1975-04-05',
  '801220-2487416',
  '회사원',
  '1',
  '0'),
 ('100007',
  '김화연',
  '경남 경주시',
  '284-8147',
  '1980-01-04',
  '790221-2482217',
  '학생',
  '1',
  '0'),
 ('100008',
  '박민선',
  '부산시 해운대구',
  '347-9124',
  '1985-04-04',
  '850527-2123827',
  '학생',
  '1',
  '0'),
 ('100009',
  '노상수',
  '전북 군산시',
  '547-2984',
  '1981-01-30',
  '741025-1441282',
  '공무원',
  '0',
  '1'),
 ('100010',
  '이민석',
  '경기도 수원시',
  '354-2723',
  '1972-08-02',
  '720802-1481395',
  '회사원',
  '0',
  '1'),
 ('100011',
  '정영미',
  '서울시 관악구',
  '272-6745',
  '1974-09-21',
  '740921-2782216',
  '주부',
  '1',
  '1')]

In [65]:
#[예제 4-22] Customer_Info 테이블에서 생년월일이 1970년 1월 1일부터 1970년 12월 31일 사이에 있는 고객들을 검색해 보아라.
sql = """SELECT CID, Name, BDay, Job FROM Customer_Info
WHERE BDay between '1970-01-01' and '1979-12-31' """ 
c.execute(sql)
c.fetchall()

[('100001', '김민주', '1975-07-01', '공무원'),
 ('100002', '정영미', '1977-02-01', '회사원'),
 ('100006', '박선희', '1975-04-05', '회사원'),
 ('100010', '이민석', '1972-08-02', '회사원'),
 ('100011', '정영미', '1974-09-21', '주부')]

In [66]:
#[예제 4-23] Customer_Score 테이블에서 2013년의 온라인 고객점수와 오프라인 고객점수의 합 (TotalScore)이 100 이상, 500이하인 고객을 검색해 보아라.
sql = """SELECT CID, Year, On_Score+Off_Score TotalScore FROM Customer_Score
WHERE Year=2013 and
TotalScore BETWEEN 100 AND 500 """
c.execute(sql) 
c.fetchall()

[('100001', '2013', 147),
 ('100002', '2013', 138),
 ('100005', '2013', 488),
 ('100008', '2013', 142)]

In [67]:
#[예제 4-24] Customer_Info 테이블에서 ‘김’씨 성을 가진 고객의 고객번호, 이름, 주소를 검색해 보아 라.
sql = """SELECT CID, Name, Address FROM Customer_Info
WHERE Name LIKE '김%' """ 
c.execute(sql)
c.fetchall()

[('100001', '김민주', '서울시 광진구'), ('100007', '김화연', '경남 경주시')]

In [68]:
#[예제 4-25] Customer_Info 테이블에서 주소가 제주도 ‘서귀포’인 고객을 검색해 보아라.
sql = """SELECT *
FROM Customer_Info
WHERE Address LIKE '%서귀포%' """ 
c.execute(sql)
c.fetchall()

[('100003',
  '최소영',
  '제주도 서귀포시',
  '624-2172',
  '1980-01-25',
  '800125-2432712',
  '학생',
  '1',
  '0')]

In [69]:
#[예제 4-26] Customer_Info 테이블에서 직업이 ‘회사원’, ‘공무원’인 고객을 검색해 보아라.
sql = """SELECT CID, Name, Job FROM Customer_Info
WHERE Job IN ('회사원', '공무원') """ 
c.execute(sql)
c.fetchall()

[('100001', '김민주', '공무원'),
 ('100002', '정영미', '회사원'),
 ('100004', '박진재', '공무원'),
 ('100005', '이순석', '회사원'),
 ('100006', '박선희', '회사원'),
 ('100009', '노상수', '공무원'),
 ('100010', '이민석', '회사원')]

In [70]:
#(4) 데이터의 그룹화 : GROUP BY
#GROUP BY 절은 특정 필드 값에 따라 데이터들을 그룹 짓는 연산자이다. GROUP BY는 일반적으로 SQL에서 제공하는 함수와 함께 사용하게 된다.
#[예제 4-27] Customer_Info 테이블에서 직업별 고객 빈도를 파악해 보아라.
sql = """SELECT Job, COUNT(*) freq FROM Customer_Info
GROUP BY Job """ 
c.execute(sql)
c.fetchall()

[('공무원', 3), ('주부', 1), ('학생', 3), ('회사원', 4)]

In [71]:
#[예제 4-28] Customer_Score 테이블에는 고객들의 2012년과 2013년 점수가 들어있다. On_Score가 모두 0보다 큰 고객들의 On_Score의 합을 구해 보아라.
sql = """SELECT CID, sum(On_Score) FROM Customer_Score WHERE On_Score > 0
GROUP BY CID """ 
c.execute(sql)
c.fetchall()

[('100001', 100),
 ('100002', 110),
 ('100003', 488),
 ('100005', 478),
 ('100006', 164),
 ('100008', 100),
 ('100009', 26)]

In [72]:
#[예제 4-29] Customer_Score 테이블에서 2012년과 2013년 자료의 고객별 Off_Score 평균 점수를 구 해 보아라.
sql = """SELECT CID, avg(Off_Score) FROM Customer_Score
GROUP BY CID """ 
c.execute(sql)
c.fetchall()

[('100001', 100.0),
 ('100002', 35.0),
 ('100003', 128.0),
 ('100004', 80.5),
 ('100005', 94.0),
 ('100006', 14.5),
 ('100007', 2.5),
 ('100008', 135.0),
 ('100009', 25.5),
 ('100010', 10.5),
 ('100011', 43.5)]

(5) 데이터 그룹화의 조건 검색 : HAVING
GROUP BY 절에서 명시된 그룹에 대한 검색 조건을 주고자 할 때 HAVING 절을 이용한다. HAVING 절은 GROUP BY 절이 없을 때에도 사용할 수 있지만 일반적으로 GROUP BY 절과 같이 이용한다. HAVING 절의 사용법은 WHERE 절과 비슷하지만 차이점은 HAVING 절 다음에는 SELECT 다음에 명 시된 필드(또는 함수)에 대해서만 조건을 줄 수 있다.

In [73]:
#[예제 4-30] Customer_Info 테이블에서 직업별 고객 빈도가 3이상인 직업을 파악해 보아라. 
sql = """SELECT Job, COUNT(*) freq
FROM Customer_Info GROUP BY Job HAVING freq >= 3 """
c.execute(sql) 
c.fetchall()

[('공무원', 3), ('학생', 3), ('회사원', 4)]

In [74]:
#[예제 4-31] Customer_Score 테이블에는 고객들의 2012년과 2013년 점수가 들어있다. 2012년과 2013년 On_Score의 합이 100보다 큰 고객들의 명단을 구해 보아라.
sql = """SELECT CID, sum(On_Score) totalScore FROM Customer_Score
GROUP BY CID
HAVING totalScore > 100 """ 
c.execute(sql)
c.fetchall()

[('100002', 110), ('100003', 488), ('100005', 478), ('100006', 164)]

(6) 출력 순서를 명시하는 검색 : ORDER BY
질의 결과로 나오는 레코드들을 정렬시키고자 할 때 ORDER BY 절을 이용한다. ORDER BY 절에서 레 코드를 정렬할 때 기준을 삼고자 하는 필드 이름을 지정하면 기본적으로 해당 필드의 값에 따라 레코드 가 오름차순으로 정렬된다.

In [77]:
#[예제 4-32] Customer_Info 테이블에서 고객들의 직업을 정렬하여 출력해 보아라. 
sql = """SELECT *FROM Customer_Info
ORDER BY Job """ 
c.execute(sql)
c.fetchall()

[('100001',
  '김민주',
  '서울시 광진구',
  '423-8627',
  '1975-07-01',
  '750701-2534218',
  '공무원',
  '1',
  '0'),
 ('100004',
  '박진재',
  '강원도 속초시',
  '543-9467',
  '1960-05-02',
  '600502-1645394',
  '공무원',
  '0',
  '1'),
 ('100009',
  '노상수',
  '전북 군산시',
  '547-2984',
  '1981-01-30',
  '741025-1441282',
  '공무원',
  '0',
  '1'),
 ('100011',
  '정영미',
  '서울시 관악구',
  '272-6745',
  '1974-09-21',
  '740921-2782216',
  '주부',
  '1',
  '1'),
 ('100003',
  '최소영',
  '제주도 서귀포시',
  '624-2172',
  '1980-01-25',
  '800125-2432712',
  '학생',
  '1',
  '0'),
 ('100007',
  '김화연',
  '경남 경주시',
  '284-8147',
  '1980-01-04',
  '790221-2482217',
  '학생',
  '1',
  '0'),
 ('100008',
  '박민선',
  '부산시 해운대구',
  '347-9124',
  '1985-04-04',
  '850527-2123827',
  '학생',
  '1',
  '0'),
 ('100002',
  '정영미',
  '경기도 수원시',
  '321-4568',
  '1977-02-01',
  '770201-2834721',
  '회사원',
  '1',
  '1'),
 ('100005',
  '이순석',
  '충남 보령시',
  '254-9124',
  '1982-06-01',
  '820601-1543714',
  '회사원',
  '0',
  '0'),
 ('100006',
  '박선희',
  '서울시 강남구',
  '459-2187',
  '1975-04-05',
  '801220-2487416',
  '회사원',
  '1',
  '0'),
 ('100010',
  '이민석',
  '경기도 수원시',
  '354-2723',
  '1972-08-02',
  '720802-1481395',
  '회사원',
  '0',
  '1')]

In [78]:
#[예제 4-33] Customer_Score 테이블에서 2012년과 2013년 자료의 고객별 Off_Score 평균이 50보다 큰 점수들을 내림차순으로 출력해 보아라.
sql = """SELECT CID, avg(Off_Score) mean FROM Customer_Score
GROUP BY CID
HAVING mean > 50 ORDER BY mean DESC"""
c.execute(sql) 
c.fetchall()

[('100008', 135.0),
 ('100003', 128.0),
 ('100001', 100.0),
 ('100005', 94.0),
 ('100004', 80.5)]

In [79]:
#(7) 둘 이상의 테이블에서 데이터 검색 : JOIN
#둘 이상의 테이블에서 원하는 데이터를 검색하고자 할 때는 조인(JOIN) 문장을 이용한다.
#[예제 4-34] 테이블 Customer_Info와 Customer_Score에서 고객번호(CID)와 이름(Name), 2013년 온 라인 점수(On_Score)를 고객번호 순으로 검색해 보아라.
sql = """SELECT C.CID, C.Name, CS.On_Score FROM Customer_Info C
JOIN Customer_Score CS
ON C.CID = CS.CID
WHERE CS.Year=2013 """ 
c.execute(sql)
c.fetchall()

[('100001', '김민주', 58),
 ('100002', '정영미', 98),
 ('100003', '최소영', 402),
 ('100004', '박진재', 0),
 ('100005', '이순석', 356),
 ('100006', '박선희', 66),
 ('100007', '김화연', 0),
 ('100008', '박민선', 44),
 ('100009', '노상수', 2),
 ('100010', '이민석', 0),
 ('100011', '정영미', 0)]

In [80]:
#[예제 4-35] 테이블 Customer_Score와 Customer_Info에서 고객번호(CID), 이름(Name), 2012년과 2013년 자료의 고객별 온라인 점수(On_Score)와 오프라인 점수(Off_Score)의 합을 점수의 합 순으로 검색해 보아라.
sql = """SELECT CS.CID, C.Name, sum(On_Score+Off_Score) total FROM Customer_Score CS
JOIN Customer_Info C
ON CS.CID = C.CID
GROUP BY CS.CID, C.Name
ORDER BY total DESC """ 
c.execute(sql)
c.fetchall()

[('100003', '최소영', 744),
 ('100005', '이순석', 666),
 ('100008', '박민선', 370),
 ('100001', '김민주', 300),
 ('100006', '박선희', 193),
 ('100002', '정영미', 180),
 ('100004', '박진재', 161),
 ('100011', '정영미', 87),
 ('100009', '노상수', 77),
 ('100010', '이민석', 21),
 ('100007', '김화연', 5)]


(8) 중첩 질의 : IN
일부 질의들은 데이터베이스 내에 존재하는 값들을 검색한 다음 이를 비교 조건에서 사용한다. 이러한 질의들은 중첩 질의를 사용해서 편리하게 나타낼 수가 있다. 중첩 질의는 어떤 질의의 WHERE 문에 완 전한 하나의 SELECT 질의가 포함되어 있는 형태의 질의이다.

In [81]:
#[예제 4-36] Customer_Score 테이블에 있는 고객들 중에서 2013년 On_Score가 0보다 큰 고객의 명 단을 Customer_Info에서 검색해 보아라.
sql = """SELECT CID, Name FROM Customer_Info
WHERE CID IN ( SELECT CID
FROM Customer_Score
WHERE Year=2013 and On_Score > 0 ) """
c.execute(sql) 
c.fetchall()

[('100001', '김민주'),
 ('100002', '정영미'),
 ('100003', '최소영'),
 ('100005', '이순석'),
 ('100006', '박선희'),
 ('100008', '박민선'),
 ('100009', '노상수')]

In [82]:
#[예제 4-37] Customer_Info 테이블에 있는 고객들 중에서 Customer_Score 테이블의 2013년 On_Score가 0보다 큰 고객번호와 점수를 검색해 보아라.
sql = """SELECT CID, On_Score FROM Customer_Score
WHERE CID IN ( SELECT CID
FROM Customer_Info )
and Year=2013 and On_Score > 0 """ 
c.execute(sql)
c.fetchall()

[('100001', 58),
 ('100002', 98),
 ('100003', 402),
 ('100005', 356),
 ('100006', 66),
 ('100008', 44),
 ('100009', 2)]